var Formula=[
    //id1,id2,id3,名称，攻击力，血量，法力，法强，攻速,护甲,魔抗，备注
    
       ["1001","1001","2001","无尽之刃","40","0","0","0","0","0","0","暴击伤害+200%"],
       ["1001","1002","2002","神圣之剑","20","0","0","0","20","0","0","每秒有7%几率获得100%暴击几率"],
       ["1001","1003","2005","海克斯的科技枪","20","0","0","20","0","0","0","33%全能吸血，但是不包括物品造成的伤害"],
       ["1001","1004","2006","朔极之矛","20","0","20","0","0","0","0","第一次释放技能后，普通攻击恢复15%最大法力"],
       ["1001","1005","2003","守护天使","20","0","0","0","0","20","0","死亡2秒后清除重伤效果，恢复800血量"],
       ["1001","1006","2008","饮血剑","20","0","0","0","0","0","20","普攻吸血+50%"],
       ["1001","1007","2009","基克的先驱","20","200","0","0","0","0","0","佩戴者和左右两个单位获得15%攻速"],
       ["1001","1008","2004","幽梦之灵","40","0","0","0","0","0","0","携带者拥有刺客羁绊"],
       ["1002","1002","2011","疾射火炮","0","0","0","0","40","0","0","双倍攻击距离，攻击不会被闪避(克制绿叉)"],
       ["1002","1003","2012","鬼索的狂暴之刃","0","0","0","20","20","0","0","每次攻击增加5%攻速"],
       ["1002","1004","2010","斯塔缇克电刃","0","0","20","0","20","0","0","每三次攻击对目标和额外三个目标造成90魔法伤害"],
       ["1002","1005","2013","幻影之舞","0","0","0","0","20","20","0","闪避所有暴击包括技能暴击(无法闪避火炮)"],
       ["1002","1006","2014","诅咒之刃","0","0","0","0","20","0","20","普攻有25%几率降低目标1星"],
       ["1002","1007","2015","幽梦之灵","0","200","0","0","20","0","0","携带者拥有刺客羁绊"],
       ["1002","1008","2016","破败王者之刃","0","0","0","0","40","0","0","携带者拥有剑士羁绊"],
       ["1003","1003","2017","灭世者的死亡之帽","0","0","0","40","0","0","0","法术强度+50%"],
       ["1003","1004","2021","卢登的回声","0","0","20","20","0","0","0","技能溅射200点魔法伤害"],
       ["1003","1005","2020","钢铁烈阳之匣","0","0","0","20","0","20","0","开局时候左和右各2个格子和自身获得持续6秒的护盾，护盾生命250点"],
       ["1003","1006","2018","离子火花","0","0","0","20","0","0","20","敌人释放技能会受到125真实伤害"],
       ["1003","1007","2022","莫雷洛秘典","0","200","0","20","0","0","0","技能造成10秒燃烧，共造成20%最大生命值真实伤害，并无法被治疗"],
       ["1003","1008","2019","悠米","0","0","0","40","0","0","0","携带者拥有法师羁绊"],
       ["1004","1004","2024","炽天使之拥","0","0","40","0","0","0","0","释放技能后恢复20法力"],
       ["1004","1005","2026","冰霜之心","0","0","20","0","0","20","0","相邻敌人减少25%攻速"],
       ["1004","1006","2027","肃静","0","0","20","0","0","0","20","普攻有33%几率使对方无法恢复法力持续4秒"],
       ["1004","1007","2025","救赎","0","200","20","0","0","0","0","生命值下降到25%时候创造区域，在小段延迟后治疗区域内1500血量"],
       ["1004","1008","2023","暗裔","0","0","40","0","0","0","0","携带者获得恶魔羁绊"],
       ["1005","1005","2029","荆棘之甲","0","0","0","0","0","40","0","反弹所减免伤害的100%的魔法伤害"],
       ["1005","1006","2031","折剑者","0","0","0","0","0","20","20","攻击有25%几率缴械目标4秒"],
       ["1005","1007","2030","蜥蜴长老之赐","0","200","0","0","0","20","0","普攻造成10秒燃烧，共造成20%最大生命值真实伤害，并无法被治疗"],
       ["1005","1008","2028","骑士之誓","0","0","0","0","0","40","0","携带者获得骑士羁绊"],
       ["1006","1006","2033","巨龙之爪","0","0","0","0","0","0","40","获得83%魔法伤害抵抗能力"],
       ["1006","1007","2032","灵风","0","200","0","0","0","0","20","战斗开始时，放逐1个敌人5秒(注意位置)"],
       ["1006","1008","2034","卢安娜的飓风","0","0","0","0","0","0","40","普攻对额外1个目标造成伤害，额外攻击造成75%的伤害，附带普攻特效"],
       ["1007","1007","2036","狂徒铠甲","0","400","0","0","0","0","0","每秒恢复6% 已损失 生命值"],
       ["1007","1008","2035","冰霜之锤 ","0","400","0","0","0","0","0","携带者获得极地羁绊"],
       ["1008","1008","2037","自然之力","0","0","0","0","0","0","0","人口+1"],
       ["0","0","1001","暴风大剑","20","0","0","0","0","0","0","0"],
       ["0","0","1002","反曲之弓","0","0","0","0","0","20","0","0"],
       ["0","0","1003","无用大棒","0","0","0","20","0","0","0","0"],
       ["0","0","1004","女神之泪","0","0","20","0","0","0","0","0"],
       ["0","0","1005","锁子甲","0","0","0","0","0","0","20","0"],
       ["0","0","1006","负极斗篷","0","0","0","0","0","0","0","20"],
       ["0","0","1007","巨人腰带","0","200","0","0","0","0","0","0"],
       ["0","0","1008","金铲铲","0","0","0","0","0","0","0","有着奇特作用"],
   ];
var Monsters=[
    ["1","2个近战小兵","随便上一个英雄即可"],
    ["2","2个近战兵一个远程兵","建议上2个英雄，一个英雄大概率打不过"],
    ["3","2个近战兵2个远程兵","建议上3个英雄，2个可能打不过"],
    ["9","3个石头人","如果有一个石头人死亡,其他石头人血量会恢复满;刺客英雄放在左侧，其他英雄放在右侧，如果有3个两星英雄可以考虑不升级人口，否则建议升级人口不然可能打不过"],
    ["15","1个大狼，4个小狼","狼群开局会隐身跳后排,星级太低可能会被秒杀"],
    ["21","1个大鸟,4个小鸟","如果有一个鸟死亡，其他鸟会变强，并且增加攻击速度。"],
    ["27","小龙","对前方造成锥形范围攻击，建议打之前先把英雄分散开，死亡后必定掉成品装备。"],
    ["33","峡谷先锋","开局会冲撞一下，死亡必定掉落成品装备"],
    ["39","远古龙","对前方造成锥形范围攻击，建议打之前先把英雄分散开，死亡后必定掉成品装备。"]
];
var synergys=[
    ["恶魔","剑魔,火男,蜘蛛,寡妇,莫甘娜,乌鸦,维鲁斯","攻击时有40%几率燃烧掉敌方20法力,并恢复自身法力",[["2","恢复量15"],["4","恢复量30"],["6","恢复量45"]]],
    ["龙族","龙王,龙女","获得魔法伤害抗性",[["2","83%法抗"]]],
    ["流亡者(浪人)","亚索","当开局附近没有友方英雄时候,获得相当于最大生命100%的护盾，不受法术强度影响",[["1","护盾强度100%"]]],
    ["极地","冰鸟,寒冰,布隆,丽桑卓,猪妹,狗熊","攻击有几率造成2秒眩晕",[["2","眩晕几率20%"],["4","眩晕几率30%"],["6","眩晕几率45%"]]],
    ["帝国","诺手,德莱文,卡特琳娜,乌鸦","受到加持的人造成双倍伤害,但不会影响物品的伤害",[["2","一个随机的帝国单位"],["4","所有帝国单位"]]],
    ["忍者","阿卡丽,凯南,慎,劫","忍者只有在1个或者4个在场才生效，增加攻击",[["正好1个","攻击力和法强+50"],["正好4个","攻击力和法强+70"]]],
    ["贵族","剑姬,盖伦,天使,蕾欧娜,卢锡安,薇恩","受到加持的人获得60护甲和魔抗,普通攻击回复35血量",[["3","一个随机的在场英雄"],["6","所有在场英雄"]]],
    ["暗影","千珏,死亡歌颂者,莫歌凯撒","开局时敌方一个随机单位血量削减到100,对史诗怪物只能造成少量伤害",[["2","敌方一个随机单位血量削减到100"]]],
    ["海盗","船长,男枪,女枪,卡牌","每局PVP结束时会获得金币,需要手动捡取",[["3","宝箱随机开出0-4金币，平均值为1.75"]]],
    ["机器人","机器人","开局时法力为满",[["1","开局时候法力为满"]]],
    ["虚空","卡萨丁,大虫子,挖掘机，螳螂","造成真实伤害",[["3","所有虚空单位操造成真实伤害"]]],
    ["狂野","阿狸,纳尔,豹女,狮子狗,狼人","攻击命中时增加12%攻速，最多叠加5层",[["2","对狂野单位生效"],["4","对所有单位生效"]]],
    ["约德尔人","纳尔,凯南,露露,波比,小炮,小法","有几率闪避普攻和攻击特效",[["3","闪避几率30%"],["6","闪避几率55%"]]],
    ["法师","卡萨丁,卡牌,露露,阿狸,小法,莫甘娜,龙王,死亡歌颂者","法师单位普攻获得双倍法力值，所有友军技能强度获得提高",[["3","增强40%"],["6","增强100%"]]],
    ["刺客","寡妇,卡特琳娜,阿卡丽,劫,派克,螳螂,狮子狗","刺客单位获得额外爆伤",[["3","爆伤+125%"],["6","爆伤+350%"]]],
    ["剑士","剑魔,亚索,德莱文,剑姬,慎,船长","有45%几率打出额外攻击",[["3","额外攻击1次"],["6","额外攻击两次"],["9","额外攻击4次"]]],
    ["斗士","狗熊,机器人,大虫子,挖掘机,狼人","斗士获得额外最大生命值",[["2","最大生命+300"],["4","最大生命+600"],["6","最大生命+1000"]]],
    ["元素使","火男,冰鸟,丽桑卓,凯南","开局时候召唤一个元素之灵",[["3","召唤一个攻击100血量2200的元素之灵"]]],
    ["护卫","布隆,蕾欧娜","战斗开始时候附近友军获得护甲(自己不会获得护甲),可叠加",[["2","获得50护甲"]]],
    ["枪手","卢锡安,女枪,船长,小炮,男枪","枪手普攻有50%几率进行额外打击",[["2","额外打击1个目标"],["4","额外打击2个目标"],["6","额外打击3个目标"]]],
    ["骑士","猪妹,诺手,天使,盖伦,莫歌凯撒,波比","所有友军格挡普攻伤害",[["2","格挡15伤害"],["4","格挡30伤害"],["6","格挡55伤害"]]],
    ["游侠","维鲁斯,寒冰,薇恩,千珏","每3秒有几率攻速翻倍,持续3秒",[["2","翻倍几率25%"],["4","翻倍几率65%"]]],
    ["换形师","乌鸦,蜘蛛,龙女,纳尔,豹女","变形时获得额外最大生命值",[["3","获得60%额外最大生命值"],["6","获得120%额外最大生命值"]]],
    ["海克斯科技","金克斯,卡密尔,杰斯,蔚","对局开始时,向一名身上有装备的敌人扔出炸弹,并且禁用装备,持续8秒",[["2","1格半径内"],["4","2格半径内"]]]

]
function ShowTips(oj)
{
       var item=getItemByid(oj.id);

       var oEvent=event;
       var tips=document.getElementById("tips");
       tips.style.left=oEvent.clientX+15+'px';  // 指定创建的DIV在文档中距离左侧的位置
       tips.style.top=oEvent.clientY+15+'px';  // 指定创建的DIV在文档中距离顶部的位置
       tips.style.display="block";
       var height=270;
       var htmlstr="<span>名称:"+item.name+"<br>"
       
       if(item.item1!=null)htmlstr+="合成物品1:"+item.item1+"<br>";
       else height-=20;

       if(item.item2!=null)htmlstr+="合成物品2:"+item.item2+"<br>";
       else height-=20;

       if(item.hp!=0)htmlstr+="生命值:"+item.hp+"<br>";
       else height-=20;

       if(item.mp!=0)htmlstr+="开局法力值:"+item.mp+"<br>";
       else height-=20;

       if(item.atk!=0)htmlstr+="攻击力:"+item.atk+"<br>";
       else height-=20;

       if(item.ap!=0)htmlstr+="法术强度:"+item.ap+"<br>";
       else height-=20;

       if(item.as!=0)htmlstr+="攻击速度:"+item.as+"<br>";
       else height-=20;

       if(item.ad!=0)htmlstr+="护甲:"+item.ad+"<br>";
       else height-=20;

       if(item.md!=0)htmlstr+="魔抗:"+item.md+"<br>";
       else height-=20;
       
       if(item.mark!=0)htmlstr+="效果:"+item.mark;
       else height-=20;
       htmlstr+="</span>";
       tips.style.width="200px";
       tips.style.height=height+"px" ;
       tips.innerHTML=htmlstr;
}
function getItemNameByID(itemid)
{
   var Item=[
       ["1001","暴风大剑"],
       ["1002","反曲之弓"],
       ["1003","无用大棒"],
       ["1004","女神之泪"],
       ["1005","锁子甲"],
       ["1006","负极斗篷"],
       ["1007","巨人腰带"],
       ["1008","金铲铲"]
   ]
   for(var i in Item)
   {
       if(Item[i][0]==itemid)return Item[i][1];
   }
}
function getItemByid(itemid)
{
   var index=0;
   var item={
               item1:"",
               item2:"",
               name:"",
               atk:"",
               hp:"",
               mp:"",
               ap:"",
               as:"",
               mark:"",
           }
   for(var i in Formula)
   {
       if(itemid==Formula[i][2])
       {
           
           item={
               item1:getItemNameByID(Formula[i][0]),
               item2:getItemNameByID(Formula[i][1]),
               name:Formula[i][3],
               atk:Formula[i][4],
               hp:Formula[i][5],
               mp:Formula[i][6],
               ap:Formula[i][7],
               as:Formula[i][8],
               ad:Formula[i][9],
               md:Formula[i][10],
               mark:Formula[i][11]
           }
          break;
       }
   }
   return item;
}

function HideTips()
{
   var tips=document.getElementById("tips");
   tips.style.display="none";
}
window.load=function()
{
   var img=document.getElementsByClassName("itemimg");
}
function showItem()
{
    hideMonsters();
    hideSynergy();
    var rightbodydiv=document.getElementsByClassName("rightbody");
    rightbodydiv[0].style.left="520px";
    document.getElementById("item").style.display="";
}

function hideItem()
{
    document.getElementById("item").style.display="none";
}

function showMonsters()
{
    hideItem();
    hideSynergy();
    var rightbodydiv=document.getElementsByClassName("rightbody");
    rightbodydiv[0].style.left="320px";
    document.getElementById("monsters").style.display="";
}
function hideMonsters()
{
    document.getElementById("monsters").style.display="none";
}


function hideSynergy()
{
    document.getElementById("synergy").style.display="none";
}

function showSynergy()
{
    hideItem();
    hideMonsters();
    var rightbodydiv=document.getElementsByClassName("rightbody");
    rightbodydiv[0].style.left="320px";
    document.getElementById("synergy").style.display="";
}


function Init()
{
    initSynergy();
    initMonster();
    initItem();
    hideItem();
    hideMonsters();
    hideSynergy();
}
function initMonster()
{
    var monstersdiv=document.getElementById("monsters");
    var htmlstr="<table class='monsterstable'><tr>";
    htmlstr+="<th>回合数</th><th>怪物</th><th>介绍和打法</th>";
    htmlstr+="</tr>";
    for(var i in Monsters)
    {
        htmlstr+="<tr><td>"+Monsters[i][0]+"</td>"
                +"<td>"+Monsters[i][1]+"</td>"
                +"<td>"+Monsters[i][2]+"</td></tr>";
    }
    htmlstr+="</tr>";
    monstersdiv.innerHTML=htmlstr;
}

function initSynergy()
{
    var monstersdiv=document.getElementById("synergy");
    var htmlstr="<table class='synergytable'><tr>";
    htmlstr+="<th>名称</th><th>英雄</th><th>介绍</th><th>组合</th>";
    htmlstr+="</tr>";
    for(var i in synergys)
    {
        htmlstr+="<tr><td>"+synergys[i][0]+"</td>"
                +"<td>"+synergys[i][1]+"</td>"
                +"<td>"+synergys[i][2]+"</td>";
        var tmpstr="<td>";
        for(var j in synergys[i][3])
        {
            tmpstr+=synergys[i][3][j][0]+":"+synergys[i][3][j][1]+"<br>";
        }
        htmlstr+=tmpstr+"</td></tr>";
    }
    htmlstr+="</tr>";
    monstersdiv.innerHTML=htmlstr;
}


function initItem()
{
    
   var itemdiv=document.getElementById("item");
   var htmlstr="<table class='itemtable'><tr><th></th>";
       for(var i=1001;i<1009;++i)
       {
           htmlstr+="<th><img id="+i+"  onmousemove='ShowTips(this)' onmouseout='HideTips()'  class='itemimg' src='./images/"+i+".png'></th>";
       }
       htmlstr+="</tr>";
       for(var i=1001;i<1009;++i)
       {
           htmlstr+="<tr><th><img id="+i+"  onmousemove='ShowTips(this)' onmouseout='HideTips()' class='itemimg' src='./images/"+i+".png'></th>";
           for(var j=1000;j<1008;++j)
           {
               htmlstr+="<td><img id='"+synthesisItem((i),((j+1)))+"' onmousemove='ShowTips(this)' onmouseout='HideTips()' class='itemimg' src='./images/"+synthesisItem(i,(j+1))+".png'><h>";
           }
           htmlstr+="</tr>";
       }
   htmlstr+="</table>";
   
   itemdiv.innerHTML=htmlstr;
}

function synthesisItem(itemid1,itemid2)
{
  
   for(var i in Formula)
   {
       if((itemid1==Formula[i][0]&&itemid2==Formula[i][1])
           ||(itemid2==Formula[i][0]&&itemid1==Formula[i][1])
       )
       {
           return Formula[i][2];
       }   
   }
   return "NULLITEM"
}